# Стягиваем образ с dockerHUB
# Этот образ имеет в себе линукс, jdk и мавен много чего ещё
# AS builder  - название этапу
FROM maven:3.9-eclipse-temurin-21 AS builder

# Создаём папку в который будем работать дальнейшем
WORKDIR /app

# Копируем пом хмл в текущую рабочую папку(/app)
COPY pom.xml .
# Скачиваем зависимости, без компиляции кода
RUN mvn dependency:go-offline

COPY src ./src

RUN mvn clean package -DskipTests

#Второй этап
FROM eclipse-temurin:21-jre-alpine

WORKDIR /app

# --from=builder мы говорим что он брал файл из первого этапа
# /app/target/*.jar - ищет внутри нашей рабочий папки из первого этапа
# скомпилированный какой-то jar файл, мы не пишем конкретное имя,
# т.к. так удобнее и универсальней
# app.jar это уже новый файл внутри нашего второго этапа
COPY --from=builder /app/target/*.jar app.jar

#Просто говорим докеру что у него такой порт, но сам порт нужно прописывать в compose.yaml
EXPOSE 8080
#хз зачем
ENV SPRING_PROFILES_ACTIVE=default
#ENTRYPOINT: Команда, которая выполнится сразу после старта контейнера. Это аналог public static void main.
# Массив ["...", "..."]: Используется форма exec (массив), чтобы аргументы передавались корректно без оболочки shell.
# java: Запускаем JVM.
# -XX:+UseContainerSupport: Критично для Docker! Сообщает Java: «Эй, мы внутри контейнера, смотри на лимиты памяти контейнера, а не хост-машины».
# Без этого Java может попытаться выделить всю память сервера и упасть с ошибкой OOM (Out Of Memory).
# -Xmx512m: Ограничивает максимальный размер кучи (памяти) до 512 МБ. Защищает контейнер от пожирания всей доступной памяти.
# -jar app.jar: Запускаем наш файл, который мы скопировали на шаге 9.
ENTRYPOINT ["java",]